docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <!-- 2022-03-31 Thu 00:36 -->
    <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>&lrm;</title>
    <meta name="author" content="Edward Langley" />
    <meta name="generator" content="Org Mode" />
    <link rel="stylesheet" href="./colors.css" />
  </head>
  <body>
    <div id="content" class="content">
      <div id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#orgb4ace78"
                >1. Sample babel transform to turn snake_case into camelCase</a
              >
            </li>
            <li><a href="#org00f7e04">2. Sample results</a></li>
            <li>
              <a href="#orgea25dc3">3. Limitations</a>
              <ul>
                <li>
                  <a href="#org25c467c"
                    >3.1. Renaming undeclared globals is problematic</a
                  >
                </li>
                <li><a href="#org4548509">3.2. Name clashes possible</a></li>
              </ul>
            </li>
          </ul>
        </div>
      </div>

      <div id="outline-container-orgb4ace78" class="outline-2">
        <h2 id="orgb4ace78">
          <span class="section-number-2">1.</span> Sample babel transform to
          turn snake_case into camelCase
        </h2>
        <div class="outline-text-2" id="text-1">
          <p>
            First we write a simple function that takes a snake_case string and
            turns it into camel case:
          </p>

          <div class="org-src-container">
            <pre
              class="src src-js"
            ><span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">snakeToCamel</span>(<span style="color: #DC8CC3;">str</span>) {
  <span style="color: #F0DFAF;">const</span> [first, ...rest] = str.split(<span style="color: #D0BF8F;">"_"</span>);
  <span style="color: #F0DFAF;">return</span> <span style="color: #D0BF8F;">`${first}${rest.map(capitalize).join("")}`</span>;
}

<span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">capitalize</span>([v, ...vs]) {
  <span style="color: #F0DFAF;">return</span> <span style="color: #D0BF8F;">`${v.toLocaleUpperCase()}${vs.join("")}`</span>;
}
</pre>
          </div>

          <p>
            Next, we define our babel plugin. We don't need any direct
            dependency on babel, since babel injects its functionality as an
            argument to the plugin. Here, we're accessing
            <code>@babel/types</code> from the argument passed to our function
            and then creating a <code>visitor</code> that handles each
            <code>Identifier</code> node. For each node, we rename it using
            babel's scope-handling functions, which handles most of the cases we
            care about, except for toplevel definitions like . To handle those,
            we replace the path with a camel-cased version of the node.
          </p>

          <div class="org-src-container">
            <pre
              class="src src-js"
            >module.exports = <span style="color: #F0DFAF;">function</span> camelCasingVisitor({ types: t }) {
  <span style="color: #F0DFAF;">return</span> {
    visitor: {
      Identifier(path) {
        <span style="color: #F0DFAF;">if</span> (isSnakeCased(path.node)) {
          path.scope.rename(path.node.name, snakeToCamel(path.node.name));
          path.replaceWith(t.identifier(snakeToCamel(path.node.name)));
        }
      },
    },
  };
};

<span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">isSnakeCased</span>(<span style="color: #DC8CC3;">node</span>) {
  <span style="color: #F0DFAF;">return</span> <span style="color: #D0BF8F;">/_/</span>.test(node.name)
}
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-org00f7e04" class="outline-2">
        <h2 id="org00f7e04">
          <span class="section-number-2">2.</span> Sample results
        </h2>
        <div class="outline-text-2" id="text-2">
          <p>
            Given this plugin, if we create a new babel project that includes it
            (relative path here because it's in the same project):
          </p>

          <div class="org-src-container">
            <pre class="src src-json">{
  <span style="color: #F0DFAF;">"compact"</span>: <span style="font-weight: bold;">false</span>,
  <span style="color: #F0DFAF;">"retainLines"</span>: <span style="font-weight: bold;">true</span>,
  <span style="color: #F0DFAF;">"plugins"</span>: [<span style="color: #D0BF8F;">"../src/index"</span>]
}
</pre>
          </div>

          <p>Then, given some javascript with snake_case identifiers:</p>

          <div class="org-src-container">
            <pre
              class="src src-js"
            ><span style="color: #F0DFAF;">import</span> { a_thing } from <span style="color: #D0BF8F;">"some_unconventional_package"</span>;

<span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">my_constant</span> = a_thing(4);

<span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">some_function_stuff</span>() {
  <span style="color: #F0DFAF;">let</span> <span style="color: #DC8CC3;">my_local_variable</span>;
  <span style="color: #F0DFAF;">return</span> <span style="color: #F0DFAF;">function</span> inner_function() {
    <span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">other_local_variable</span> = 1;
    <span style="color: #F0DFAF;">return</span> my_local_variable + other_local_variable + <span style="color: #D0BF8F;">"!"</span>;
  };
}

<span style="color: #A6A689; background-color: #111112;">// </span><span style="color: #A6A689; background-color: #111112;">Renaming this one is sort of dangerous &#129300;</span>
undeclared_variable = 234;
</pre>
          </div>

          <p>We get this output:</p>

          <div class="org-src-container">
            <pre
              class="src src-js"
            ><span style="color: #F0DFAF;">import</span> { aThing } from <span style="color: #D0BF8F;">"some_unconventional_package"</span>;

<span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">myConstant</span> = aThing(4);

<span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">someFunctionStuff</span>() {
  <span style="color: #F0DFAF;">let</span> <span style="color: #DC8CC3;">myLocalVariable</span>;
  <span style="color: #F0DFAF;">return</span> <span style="color: #F0DFAF;">function</span> innerFunction() {
    <span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">otherLocalVariable</span> = 1;
    <span style="color: #F0DFAF;">return</span> myLocalVariable + otherLocalVariable + <span style="color: #D0BF8F;">"!"</span>;
  };
}

<span style="color: #A6A689; background-color: #111112;">// </span><span style="color: #A6A689; background-color: #111112;">Renaming this one is sort of dangerous &#129300;</span>
undeclaredVariable = 234;
</pre>
          </div>
        </div>
      </div>

      <div id="outline-container-orgea25dc3" class="outline-2">
        <h2 id="orgea25dc3">
          <span class="section-number-2">3.</span> Limitations
        </h2>
        <div class="outline-text-2" id="text-3"></div>
        <div id="outline-container-org25c467c" class="outline-3">
          <h3 id="org25c467c">
            <span class="section-number-3">3.1.</span> Renaming undeclared
            globals is problematic
          </h3>
          <div class="outline-text-3" id="text-3-1">
            <p>
              the js_src(undeclared_variable} example above is a bit
              problematic: with this transform, there's no way to access names
              you don't control that might exist in the global environment of
              your code. We could add some sort of comment directive for this,
              but it would mar the aesthetics of the demo. We could also just
              leave them alone, but that would mar the aesthetics too.
            </p>
          </div>
        </div>

        <div id="outline-container-org4548509" class="outline-3">
          <h3 id="org4548509">
            <span class="section-number-3">3.2.</span> Name clashes possible
          </h3>
          <div class="outline-text-3" id="text-3-2">
            <p>
              The names don't always manage to avoid collisions, if a matching
              camelCase identifier already exists. For example this code:
            </p>

            <div class="org-src-container">
              <pre
                class="src src-js"
              ><span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">a_name</span> = <span style="color: #D0BF8F;">'foo'</span>
<span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">aName</span>() {}

<span style="color: #A6A689; background-color: #111112;">// </span><span style="color: #A6A689; background-color: #111112;">This will be renamed to aName and clash with the function</span>
a_name.toLower();
</pre>
            </div>

            <p>Produces this result:</p>

            <div class="org-src-container">
              <pre
                class="src src-js"
              ><span style="color: #F0DFAF;">const</span> <span style="color: #DC8CC3;">aName</span> = <span style="color: #D0BF8F;">'foo'</span>;
<span style="color: #F0DFAF;">function</span> <span style="color: #8CD0D3;">aName</span>() {}

<span style="color: #A6A689; background-color: #111112;">// </span><span style="color: #A6A689; background-color: #111112;">This will be renamed to aName and clash with the function</span>
aName.toLower();
</pre>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div id="postamble" class="status">
      <p class="author">Author: Edward Langley</p>
      <p class="date">Created: 2022-03-31 Thu 00:36</p>
      <p class="validation">
        <a href="https://validator.w3.org/check?uri=referer">Validate</a>
      </p>
    </div>
  </body>
</html>
